/*
Напишите программу, которая выдает пре^федительный звуковой сигнал, а за
тем выводит следующий текст:
Напуганная внезапным звуком, Вика вскрикнула:
"Во имя всех звезд, что это было!"
*/

#include "stdio.h"

int main() {
    printf("\aНапуганная внезапным звуком, Вика вскрикнула:\n");
    printf("\"Во имя всех звезд, что это было!\"\n");
}