# Дан список [[1, 2, [’Ok!’, 3]], [’list’, 4], 5]. Выведите на экран строку 
# ’Ok!’, использовав синтаксис доступа к элементу списка по его индексу

lst = [[1, 2, ['Ok!', 3]], ['list', 4], 5]
print(lst[0][2][0])