# Создание пароля посредством генерирования случайных символов может обернуться 
# сложностью в запоминании полученной относительно надежной последовательности. 
# Некоторые системы создания паролей рекомендуют сцеплять вместе два слова на 
# английском языке, тем самым упрощая запоминание заветного ряда символов – правда,
# в ущерб его надежности. Напишите программу, которая будет открывать файл со списком
# слов, случайным образом выбирать два из них и сцеплять вместе для получения итогового
# пароля. При создании пароля исходите из следующего требования: он должен состоять
# минимум из восьми символов и максимум из десяти, каждое из используемых слов должно
# быть длиной хотя бы в три буквы. Кроме того, сделайте заглавными первые буквы обоих
# слов, чтобы легко можно было понять, где заканчивается одно и начинается другое.
# По завершении процесса полученный пароль должен быть отображен на экране.

import random
import os

file = open("src/pass_words.txt", "r")

def create_password(file): 

    password = ""
    words = file.read().split()

    for i in range(2):
        password += random.choice(words).capitalize()
    
    return password

print(create_password(file))