// 2. Напишите программу, выводящую ваше имя и адрес.

#include "stdio.h"

int main() {
    printf("Никита\nг. Новосибирск, ул. Восход 9 (Общежитие СибГУТИ №2)\n");
}